In [17]:
#Formatting tampilan Data Frame

In [18]:
import pandas as pd, numpy as np

In [19]:
n_rows = 5
n_cols = 2
cols = ['omset', 'penjualan']

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)),
                 columns=cols)
df

   omset  penjualan
0      4          5
1     12         12
2     14          8
3     10         11
4     17          6

In [20]:


df['omset'] = df['omset'] * 100_000
df['penjualan'] = df['penjualan'] * 10_000
df

     omset  penjualan
0   400000      50000
1  1200000     120000
2  1400000      80000
3  1000000     110000
4  1700000      60000

In [21]:
df.index = pd.util.testing.makeDateIndex(n_rows, freq='D')
df = df.reset_index()
df = df.rename(columns={'index':'tanggal'})
df

     tanggal    omset  penjualan
0 2000-01-01   400000      50000
1 2000-01-02  1200000     120000
2 2000-01-03  1400000      80000
3 2000-01-04  1000000     110000
4 2000-01-05  1700000      60000

In [22]:
#melakukan formating tampilan data rame
# dengan .style.format

In [23]:
formatku = {'tanggal':'{:%d/%m/%y}',
           'operasional':'Rp {:.2f}',
           'omset':'Rp {:.2f}'}
laporan = df.style.format(formatku)
laporan

In [24]:
type(laporan)

#object bukan bertipe data  data frame
#tapi objectnya adalah styler
#jadi tidak bisa melakukan apa yg bisa dilakukan data frame

pandas.io.formats.style.Styler

In [27]:
laporan.head()
df.head()

AttributeError: 'Styler' object has no attribute 'head'

In [26]:
laporan.hide_index()

In [28]:
laporan.set_caption('Data Omset dan Operasional')

In [29]:
#kita bisa memberikan highlight nilai minimun dan maksimum

laporan.highlight_min('omset', color='pink')
laporan.highlight_max('omset', color='green')

laporan.highlight_min('penjualan', color='blue')
laporan.highlight_max('penjualan', color='green')